Autodesk.Revit.DB.UpdaterInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.UpdaterInfo.IsOptional
Whether the updater is optional or not.
Since:
2012

Autodesk.Revit.DB.UpdaterInfo.ApplicationName
Name of the application that owns the updater.
Since:
2012

Autodesk.Revit.DB.UpdaterInfo.AdditionalInformation
Additional information about the updater.
Since:
2012

Autodesk.Revit.DB.UpdaterInfo.UpdaterName
Name of the updater.
Since:
2012

Autodesk.Revit.DB.UpdaterInfo
Information of an updater, such as: Name, AdditionalInformation, name of the application that owns the updater, etc.
Since:
2012